from config import OWNER_USERNAME, SUPPORT_GRP
from RAUSHAN import BOT_NAME, BOT_USERNAME

START = f"""
**╭───────────────────⦿**
**│❍ سلام! من {BOT_NAME} هستم •**
**├───────────────────⦿**
**│❍ من ذهن شما را می‌خوانم •**
**│❍ یک ربات چت مبتنی بر هوش مصنوعی •**
**├───────────────────⦿**
**│❍ ربات مخصوص گروه‌های تلگرام •**
**│❍ من می‌توانم به شما کمک کنم •**
**│❍ برای فعال‌سازی در گروه شما •**
**│❍ دستور /chatbot [on/off] را استفاده کنید •**
**│❍ برای راهنمایی از دکمه راهنما استفاده کنید •**
**│❍ 24 ساعته آنلاین •**
**├───────────────────⦿**
**│❍ ساخته شده توسط [NITRO PLUS](http://t.me/purvi_support) ♡**
**╰───────────────────⦿**
"""

HELP_READ = f"""
<u>**دستورات {BOT_NAME}**</u>
**در زیر آمده است!**
**تمام دستورات با / شروع می‌شوند**
**──────────────**
<b>๏ سازنده @{OWNER_USERNAME}</b>
"""

TOOLS_DATA_READ = f"""
<u>**ابزارهای {BOT_NAME}:**</u>
**➻ از /ping برای بررسی سرعت پاسخگویی {BOT_NAME} استفاده کنید**
**──────────────**
**➻ از /id برای دریافت شناسه کاربری، شناسه گروه و شناسه پیام در یک پیام استفاده کنید**
**───────────────**
<b>๏ سازنده @{OWNER_USERNAME}</b>
"""

CHATBOT_READ = f"""
<u>**دستورات {BOT_NAME}**</u>
**➻ از /chatbot برای فعال/غیرفعال کردن ربات چت استفاده کنید**
**๏ نکته ➻ دستور فوق فقط در گروه کار می‌کند!!**
**───────────────**
<b>๏ سازنده @{OWNER_USERNAME}</b>
"""

SOURCE_READ = f"""
**سلام، کد منبع [{BOT_NAME}](https://t.me/{BOT_USERNAME}) در زیر آمده است.**
**لطفاً مخزن را فورک کرده و به آن ستاره دهید ✯**
**──────────────────**
**اینجا [کد منبع](https://t.me/beblnn) است**
**──────────────────**
**اگر با مشکلی مواجه شدید، با [گروه پشتیبانی](https://t.me/{SUPPORT_GRP}) تماس بگیرید.**

<b>๏ سازنده @{OWNER_USERNAME}</b>
"""

ADMIN_READ = "به‌زودی"

ABOUT_READ = f"""
**➻ [{BOT_NAME}](https://t.me/{BOT_USERNAME}) یک ربات چت مبتنی بر هوش مصنوعی است.**
**➻ [{BOT_NAME}](https://t.me/{BOT_USERNAME}) به طور خودکار به کاربران پاسخ می‌دهد.**
**➻ به شما در فعال‌سازی گروه‌هایتان کمک می‌کند.**
**➻ نوشته شده با [پایتون](https://www.python.org) و [مونگو-دی‌بی](https://www.mongodb.com) به عنوان پایگاه داده**
**───────────────**
**➻ برای دریافت راهنمایی و اطلاعات اولیه درباره [{BOT_NAME}](https://t.me/{BOT_USERNAME}) روی دکمه‌های زیر کلیک کنید**
"""
